In [2]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np
from datetime import datetime
#pd.set_printoptions(notebook_repr_html=False)

from pandas import *

import matplotlib as mpl

In [3]:
dates = pd.date_range('2012-07-16', '2012-07-21')
atemps = Series([101.5, 98, 95, 99, 100, 92], index = dates)

In [4]:
atemps

2012-07-16    101.5
2012-07-17     98.0
2012-07-18     95.0
2012-07-19     99.0
2012-07-20    100.0
2012-07-21     92.0
Freq: D, dtype: float64

In [5]:
# Created a series of temps with datetime objects as the indicies

In [6]:
idx = atemps.index[2]
atemps[idx]

95.0

In [7]:
sdtemps = Series([73, 78, 77, 78, 78, 77], index=dates)

In [8]:
temps = DataFrame({'Austin' : atemps, 'San Diego': sdtemps})

In [9]:
temps

            Austin  San Diego
2012-07-16   101.5         73
2012-07-17    98.0         78
2012-07-18    95.0         77
2012-07-19    99.0         78
2012-07-20   100.0         78
2012-07-21    92.0         77

In [10]:
temps['San Diego']

2012-07-16    73
2012-07-17    78
2012-07-18    77
2012-07-19    78
2012-07-20    78
2012-07-21    77
Freq: D, Name: San Diego, dtype: int64

In [11]:
temps['Diff'] = temps['Austin'] - temps['San Diego']

In [12]:
temps

            Austin  San Diego  Diff
2012-07-16   101.5         73  28.5
2012-07-17    98.0         78  20.0
2012-07-18    95.0         77  18.0
2012-07-19    99.0         78  21.0
2012-07-20   100.0         78  22.0
2012-07-21    92.0         77  15.0

In [13]:
del temps['Diff']
temps

            Austin  San Diego
2012-07-16   101.5         73
2012-07-17    98.0         78
2012-07-18    95.0         77
2012-07-19    99.0         78
2012-07-20   100.0         78
2012-07-21    92.0         77

In [14]:
# Stopped lecture at 34:37 https://www.youtube.com/watch?v=0unf-C-pBYE

In [15]:
temps.index

<class 'pandas.tseries.index.DatetimeIndex'>
[2012-07-16, ..., 2012-07-21]
Length: 6, Freq: D, Timezone: None

In [16]:
temps.columns

Index([u'Austin', u'San Diego'], dtype='object')

In [17]:
temps.columns.values

array(['Austin', 'San Diego'], dtype=object)

In [23]:
temps.ix[2] #Selects the row @ index 2

Austin       95
San Diego    77
Name: 2012-07-18 00:00:00, dtype: float64

In [24]:
idx = temps.index[2] #idx = the timestamp at index 2
temps.ix[idx:, ['San Diego', 'Austin']] #slice on or after index 2 and flips San Diego and Austin

            San Diego  Austin
2012-07-18         77      95
2012-07-19         78      99
2012-07-20         78     100
2012-07-21         77      92

In [29]:
temps.mean()

Austin       97.583333
San Diego    76.833333
dtype: float64

In [31]:
temps - temps.mean() #difference from the mean for each city

              Austin  San Diego
2012-07-16  3.916667  -3.833333
2012-07-17  0.416667   1.166667
2012-07-18 -2.583333   0.166667
2012-07-19  1.416667   1.166667
2012-07-20  2.416667   1.166667
2012-07-21 -5.583333   0.166667

In [32]:
temps[temps.Austin > 100] # Select the data where Austin was hotter than 100 degrees

            Austin  San Diego
2012-07-16   101.5         73

In [37]:
df = pd.read_csv('data/test1.csv')
df

                  date         0         1         2         3
0  2000-01-01 00:00:00  1.103763 -1.909979 -0.808956 -2.392629
1  2000-01-02 00:00:00  1.188917  0.581120  0.861597 -0.213885
2  2000-01-03 00:00:00 -0.964200  0.779764  1.829062  0.322422
3  2000-01-04 00:00:00  0.782130 -1.720670 -1.108242  1.233489
4  2000-01-05 00:00:00 -1.867017 -0.528368 -2.488309  1.480342
5  2000-01-06 00:00:00  2.569280 -0.471901 -0.835033 -0.532133
6  2000-01-07 00:00:00 -0.399323 -0.676427 -0.011256  0.223252
7  2000-01-08 00:00:00  1.642993  1.013420  1.435667 -0.635862
8  2000-01-09 00:00:00  1.147308  2.138000  0.554171 -0.255538
9  2000-01-10 00:00:00  0.933766  1.387155 -0.560143 -0.787083

In [40]:
df.date[0]

'2000-01-01 00:00:00'

In [41]:
# pd.read_clipborard, pd.read_fwf, pd.read_table

In [54]:
df2 = pd.read_csv('data/test1.csv', parse_dates=['date']) # turns the date column from a string into datetime
df3 = df2.set_index('date', drop=False) # turns the index indo an accessible column
df3

                 date         0         1         2         3
date
2000-01-01 2000-01-01  1.103763 -1.909979 -0.808956 -2.392629
2000-01-02 2000-01-02  1.188917  0.581120  0.861597 -0.213885
2000-01-03 2000-01-03 -0.964200  0.779764  1.829062  0.322422
2000-01-04 2000-01-04  0.782130 -1.720670 -1.108242  1.233489
2000-01-05 2000-01-05 -1.867017 -0.528368 -2.488309  1.480342
2000-01-06 2000-01-06  2.569280 -0.471901 -0.835033 -0.532133
2000-01-07 2000-01-07 -0.399323 -0.676427 -0.011256  0.223252
2000-01-08 2000-01-08  1.642993  1.013420  1.435667 -0.635862
2000-01-09 2000-01-09  1.147308  2.138000  0.554171 -0.255538
2000-01-10 2000-01-10  0.933766  1.387155 -0.560143 -0.787083

In [47]:
# The column names are strings

In [49]:
df2.index.name # the index_col='date' names the index

'date'

In [56]:
pd.read_csv('data/test2.csv')

         date         0         1         2         3      time
0  2000-01-01  1.103763 -1.909979 -0.808956 -2.392629  00:00:00
1  2000-01-02  1.188917  0.581120  0.861597 -0.213885  00:00:00
2  2000-01-03 -0.964200  0.779764  1.829062  0.322422  00:00:00
3  2000-01-04  0.782130 -1.720670 -1.108242  1.233489  00:00:00
4  2000-01-05 -1.867017 -0.528368 -2.488309  1.480342  00:00:00
5  2000-01-06  2.569280 -0.471901 -0.835033 -0.532133  00:00:00
6  2000-01-07 -0.399323 -0.676427 -0.011256  0.223252  00:00:00
7  2000-01-08  1.642993  1.013420  1.435667 -0.635862  00:00:00
8  2000-01-09  1.147308  2.138000  0.554171 -0.255538  00:00:00
9  2000-01-10  0.933766  1.387155 -0.560143 -0.787083  00:00:00

In [57]:
# Date and time are split across two columns

In [62]:
pd.read_csv('data/test2.csv', parse_dates=[['date', 'time']]) #combines the two in to one column

   date_time         0         1         2         3
0 2000-01-01  1.103763 -1.909979 -0.808956 -2.392629
1 2000-01-02  1.188917  0.581120  0.861597 -0.213885
2 2000-01-03 -0.964200  0.779764  1.829062  0.322422
3 2000-01-04  0.782130 -1.720670 -1.108242  1.233489
4 2000-01-05 -1.867017 -0.528368 -2.488309  1.480342
5 2000-01-06  2.569280 -0.471901 -0.835033 -0.532133
6 2000-01-07 -0.399323 -0.676427 -0.011256  0.223252
7 2000-01-08  1.642993  1.013420  1.435667 -0.635862
8 2000-01-09  1.147308  2.138000  0.554171 -0.255538
9 2000-01-10  0.933766  1.387155 -0.560143 -0.787083

In [64]:
pd.read_csv('data/test2.csv', parse_dates=[['date', 'time']], index_col='date_time') #sets index

                   0         1         2         3
date_time
2000-01-01  1.103763 -1.909979 -0.808956 -2.392629
2000-01-02  1.188917  0.581120  0.861597 -0.213885
2000-01-03 -0.964200  0.779764  1.829062  0.322422
2000-01-04  0.782130 -1.720670 -1.108242  1.233489
2000-01-05 -1.867017 -0.528368 -2.488309  1.480342
2000-01-06  2.569280 -0.471901 -0.835033 -0.532133
2000-01-07 -0.399323 -0.676427 -0.011256  0.223252
2000-01-08  1.642993  1.013420  1.435667 -0.635862
2000-01-09  1.147308  2.138000  0.554171 -0.255538
2000-01-10  0.933766  1.387155 -0.560143 -0.787083